twophase/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Write new boundary to constant/polyMesh/boundary
pointSync false;

patches
(
    {
        name            Sparger;
        patchInfo
        {
            type            wall;
        }
        constructFrom   set;
        set             spargerFaces;
    }
);

// ************************************************************************* //
