twophase/constant/MRFProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      MRFProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Rotor_Impeller1
{
    cellZone    Rotor_Impeller1;
    active      yes;

    nonRotatingPatches ();

    origin      (0 0 0);
    axis        (0 0 1);
    omega       100 [rpm];
}

Rotor_Impeller2
{
    cellZone    Rotor_Impeller2;
    active      yes;

    nonRotatingPatches ();

    origin      (0 0 0);
    axis        (0 0 1);
    omega       100 [rpm];
}

Rotor_Impeller3
{
    cellZone    Rotor_Impeller3;
    active      yes;

    nonRotatingPatches ();

    origin      (0 0 0);
    axis        (0 0 1);
    omega       100 [rpm];
}

Rotor_Impeller4
{
    cellZone    Rotor_Impeller4;
    active      yes;

    nonRotatingPatches ();

    origin      (0 0 0);
    axis        (0 0 1);
    omega       100 [rpm];
}

// ************************************************************************* //
