twophase/0/T.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    Reactor_Wall
    {
        type            zeroGradient;
    }

    LiquidLevel
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    Baffles
    {
        type            zeroGradient;
    }

    Impeller_1
    {
        type            zeroGradient;
    }

    Impeller_2
    {
        type            zeroGradient;
    }

    Impeller_3
    {
        type            zeroGradient;
    }

    Impeller_4
    {
        type            zeroGradient;
    }

    Shaft
    {
        type            zeroGradient;
    }

    Sparger
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
