twophase/system/mapFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      mapFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Patch pairs: map source patch → target patch (where names differ)
patchMap
(
    Reactor_Wall  Reactor_Wall
    Baffles       Baffles
    LiquidLevel   LiquidLevel
    Impeller_1    Impeller_1
    Impeller_2    Impeller_2
    Impeller_3    Impeller_3
    Impeller_4    Impeller_4
    Shaft         Shaft
);

// Patches on the target mesh that have no equivalent in the source
// (Sparger didn't exist in single-phase; fill from internal field)
cuttingPatches
(
    Sparger
);

// ************************************************************************* //
